[{"title":"Parallel Design Pattern","date":"2020-02-16T16:35:57.000Z","path":"2020/02/16/Parallel-Design-Pattern/","text":"Terms Task Unit of Executionn (UE) = process / thread Processing Element (PE) = node Patterns Algorithm Strategy Task Parallelism Divided and conquer Geometric Decomposition Recrusive Data Pipelines Event-Based Coordination Actor pattern Supporting Structures (Program Structure and Data Structure) Master / Worker Loop Parallelism Fork / Join Shared Queue SPMD Shared Data Distributed Array Active messaging Vectorisation Components of a Design Pattern Pattern Name Problem 描述问题，此处不涉及并行性 Descriptionn of the context详细描述所选择的pattern，以及可以用在哪里，以及怎么用 The forcesgoals and constraints影响该pattern正常使用的东西 The solution Geometric Decomposition Data areas可分，且并发。 Data structure通常是数组，或是图片 不适合具有层次的数据结构，例如树 对一个元素的操作涉及它自己和邻居元素 The forces如何定义子域及分配子域performanceload balance子域如何获取计算所需要的数据parallelisation overheads Solution Data decomposition : 如何划分子域shape of subdomainshow many subdomainsWhere data start Already in domain? init in one UE then distribute?data even or uneven?Granularity 粒度 coarse-grained or fine-grained Exchange operation : 来自邻域的影响common approach : halo-swapping Update operation : 计算Overlapping compute and communication non-blocking communication Task scheduling Program structureloop parallelism OpenMPSPMD MPI Recursive Data Problem nameDFS Descriptionn of the contextFor each node compute the root of the tree containing that node.Naive parallelism : operate on subtrees in parallel but can not operate on all element concurrentlyRecasting for parallism : Compute the one hop parent of each node. Compute the parent&apos;s parent. Again. ForcesRecasting can ensure the data structure can be operated on independently, but coould increase the total amount of work to be performed. trade-offRecasting the problem may be difficult.Parallelism exposed may not be efficiently exploitable Solution。。。 name - find concurrency data dependent - so data decomposition linear - so we not use recursive data only need to conmunicate with their neighbors no task parallel not too much computation, so do bad in load balance tasks are weak of independence, why? so need to communicate frequently, overhead –need to rethink pipeline computation don’t need much stages, so very quickly to finish","tags":[{"name":"parallel pattern","slug":"parallel-pattern","permalink":"http://yoursite.com/tags/parallel-pattern/"}]},{"title":"test_my_site","date":"2020-02-15T19:39:58.000Z","path":"2020/02/15/test-my-site/","text":"","tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"},{"name":"BlueLake","slug":"BlueLake","permalink":"http://yoursite.com/tags/BlueLake/"}]},{"title":"Hello World","date":"2020-02-15T19:34:24.798Z","path":"2020/02/15/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]